{"pages":[],"posts":[{"title":"(CSS) Magic Is Real With Houdini","text":"Fed up with bloated hacky JavaScript manipulating CSS? Me too! Enter the Houdini Task Force with one simple goal…outline a collection of drafts to be accepted by W3C &amp; added as common web standards. Well it doesn’t seem that simple but these guys are making great strides for the web and developers sake. Houdini will in essence offer the ability to extend the CSS rendering engine with low-level JavaScript APIs. Which will allow authors to extend the CSS engine offering massive improvements &amp; capabilities from a user experience &amp; performance point of view. Specifications Worklets CSS Paint API CSS Animation Worklet CSS Layout API Typed CSSOM WorkletsView specification Worklets themselves aren’t really anything to write home about. Similar to a Web Worker a Worklet is more of a concept that makes use of ES2015 class definitions helping to expose these low-level APIs within our browser. So what is a Worklet? A Worklet is almost like a mini event loop (what is the event loop) that can attach or reposition itself to different events it is configured to. In the words of Surma think of it as your swiss army knife to accessing these low-level APIs. Let’s look at our first low-level API that Worklets give us access to, the CSS Paint API. As most of these specs are still in the draft phase you may need to enable experimental web features to see them in action. chrome://flags/#enable-experimental-web-platform-featuresRead more about Worklets CSS Paint APIView specification Ok what the hell does this thing do you ask &amp; why should I be excited about it! Imagine being able to programmatically control exactly what, when &amp; how an object is drawn to the screen. With greater control using SVGs or jamming image files into your CSS may well become less of a headache. Instead of using things like background-image or border-image you can now reference a paint worklet like so paint(myPainter). Enough with the jabber show me the goodies dag-nab-it! Example Read more about CSS Paint API CSS Animation WorkletView specification This super-sweet Worklet allows us to run a set of instructions on a device at it’s native frame rate preventing jumpy &amp; awkward animations. The first port of call for most animations in CSS is CSS Transitions, CSS Animations &amp; the more complex Web Animations API. With the CSS Animation API / Worklet we can listen for any user input even scroll events! This topic is quite extensive so to prevent boredom I suggest checking out the example below &amp; read more if you fancy. Example Read more about CSS Animation Worklet CSS Layout APIView specification With the ability to create &amp; control your layouts with enormous detail never imagined before! The layout worklet can even help you build your own layouts &amp; pass them into the display property, like so display: layout(&#39;myLayout&#39;). Example Read more about the CSS Layout API Typed CSSOMView specification CSS Object Model or Cascading Style Sheets Object Model (Typed CSSOM). If you are familiar with a programming language or two you might have stumbled upon some Object Oriented stuff &amp; data types. What this specification focuses on is the typing part, mainly the typing of CSS values as JavaScript objects. With Typed CSSOM every CSS value is now a member of a new base class called CSSStyleValue. These values can then be extended to help authors manage calculations &amp; different value types such as rem, px, em &amp; percent. Example The Task ForceWith engineers from the likes of Apple, Google &amp; Microsoft working together (i know scary right!) on these potentially new web standards how could you not be excited! ConclusionI wanted to keep these sections brief…so there you have it! Not all the specifications are fully stable at the moment but Houdini &amp; Worklets won’t be going away anytime soon. Keep your ear close to the coconut on this one peoples. Resources Is Houdini Ready Yet? CSS Houdini Github Wiki Houdini updates on developer.google. Houdini draft specifications Chrome Dev Summit Video Google Chrome Lab Houdini Examples","link":"/2019/03/29/CSS-Magic-is-real-with-Houdini/"}],"tags":[{"name":"CSS","slug":"CSS","link":"/tags/CSS/"},{"name":"Houdini","slug":"Houdini","link":"/tags/Houdini/"},{"name":"JavaScript API","slug":"JavaScript-API","link":"/tags/JavaScript-API/"}],"categories":[]}